function [stack_delta, detar] = trajectory(t,etar)

%% 期望轨迹

stack_delta = {[0; 0; 0]; [0; 0; 0]; [0; 0; 0]; [0; 0; 0]; [0; 0; 0]; 
               [0; 0; 0]; [0; 0; 0]; [0; 0; 0]; [0; 0; 0]; [0; 0; 0]};


% 定义阶段时间
    T_1 = 30;  % 阶段1结束时间
    T_2 = 40;  % 阶段2结束时间
    T_3 = 85;  % 阶段3结束时间
    T_4 = 95;  % 阶段4结束时间
    T_5 = 198;  % 阶段5结束时间
    T_6 = 208;  % 阶段6结束时间
    T_7 = 290;  % 阶段6结束时间
    T_8 = 300;  % 阶段6结束时间

    T_1 = 60;  % 阶段1结束时间
    T_2 = 80;  % 阶段2结束时间
    T_3 = 165;  % 阶段3结束时间
    T_4 = 175;  % 阶段4结束时间
    T_5 = 378;  % 阶段5结束时间
    T_6 = 388;  % 阶段6结束时间
    T_7 = 500;  % 阶段6结束时间
    T_8 = 520;  % 阶段6结束时间

if t <= T_1
    % 阶段1: 直线进入海湾
    vene = [1; 0; 0]; % 期望速度 [u; v; r]
elseif t > T_1 && t <= T_2
    % 阶段2: 顺时针回转 90 度
    vene = [0.8; 0; 0.5*pi/(T_2-T_1)]; % 期望速度 [u; v; r]
elseif t > T_2 && t <= T_3
    % 阶段3: 直线
    vene = [1; 0; 0]; % 期望速度 [u; v; r]
elseif t > T_3 && t <= T_4
    % 阶段4: 针回转 90 度
    vene = [1; 0; 0.5*pi/(T_4-T_3)]; % 期望速度 [u; v; r]
elseif t > T_4 && t <= T_5
    % 阶段5: 直线
    vene = [1; 0; 0]; % 期望速度 [u; v; r]
elseif t > T_5 && t <= T_6
% 阶段6: 顺时针回转 90 度
    vene = [0.8; 0; 0.5*pi/(T_6-T_5)]; % 期望速度 [u; v; r]
elseif t > T_6 && t <= T_7
% 阶段7: 直线
    vene = [2; 0; 0]; % 期望速度 [u; v; r]
    elseif t > T_7 && t <= T_8
% 阶段8: 逆时针回转 90 度
   vene = [1; 0; 0.5*pi/(T_8-T_7)]; % 期望速度 [u; v; r]
else
    % 阶段: 直线
    vene = [2; 0; 0]; % 期望速度 [u; v; r]
end

phi = etar(3);
Rphi = [cos(phi) -sin(phi) 0; sin(phi) cos(phi) 0; 0 0 1];
detar = Rphi *vene;
